{
  "backend/main.mo": "Motoko backend defining garment design types, user profiles, and CRUD operations with authorization checks.",
  "feature_evidence.json": "Feature-to-file mapping report listing implemented features, associated source files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in the Dripify app.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theming variables, dark mode tokens, and base styles.",
  "frontend/index.html": "Base HTML document that loads the React app via the main TypeScript entry point.",
  "frontend/src/App.tsx": "Main React app managing authentication, design editing workflow, UI layout, and tabbed 2D/3D interfaces.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time users to enter and save their display name with validation and mutation handling.",
  "frontend/src/components/dripify/AppLayout.tsx": "Provides the main page layout with background texture and a footer containing social links and dynamic app info.",
  "frontend/src/components/dripify/editor/DesignCanvas2D.tsx": "Implements a 2D canvas for rendering, selecting, and dragging text layers with grid and styling support.",
  "frontend/src/components/dripify/editor/FontPicker.tsx": "Provides a searchable, categorized font selection popover that updates a selected text layer’s font.",
  "frontend/src/components/dripify/editor/LayersPanel.tsx": "Shows a list of text layers with options to add, select, reorder, and delete layers.",
  "frontend/src/components/dripify/editor/TextLayerControls.tsx": "Offers controls for editing text content, font, style, size, rotation, and color of the active text layer.",
  "frontend/src/components/dripify/GarmentSelector.tsx": "Renders a garment selection card allowing users to pick between preset garment types with thumbnail previews.",
  "frontend/src/components/dripify/HeaderBar.tsx": "Displays the top navigation bar with logo, auth controls, and design save/load actions based on user authentication.",
  "frontend/src/components/dripify/persistence/SavedDesignsSheet.tsx": "UI sheet to list, load, rename, and delete saved designs using design hooks and dialogs.",
  "frontend/src/components/dripify/persistence/SaveDesignButton.tsx": "Provides a dialog for naming and saving a design, validating input and sending formatted layer data to persistence hooks.",
  "frontend/src/components/dripify/preview3d/Dripify3DPreview.tsx": "Renders a 3D garment preview with react-three-fiber, selecting models and applying a generated design texture.",
  "frontend/src/components/dripify/preview3d/garments/HoodieMock.tsx": "Three.js hoodie mock model that slowly rotates and displays the design texture on a front plane.",
  "frontend/src/components/dripify/preview3d/garments/TShirtMock.tsx": "Three.js t‑shirt mock model with rotating group and a front design texture plane.",
  "frontend/src/components/dripify/preview3d/useDesignTexture.ts": "Generates a THREE.CanvasTexture by drawing text layers onto an offscreen canvas.",
  "frontend/src/fonts/fontRegistry.ts": "Registry of available fonts with names, families, categories, and availability flags.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on identity change.",
  "frontend/src/hooks/useDesigns.ts": "React Query hooks for listing, fetching, saving, renaming, and deleting user designs via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context providing identity state, login, logout, and initialization logic.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving and saving the caller's user profile through the backend actor with query invalidation.",
  "frontend/src/index.css": "Imports many Google Fonts, initializes Tailwind layers, and defines global OKLCH color variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, then renders App.",
  "frontend/src/state/dripify/designState.ts": "Defines text-layer and design state structures and provides helpers to create, update, delete, and reorder text layers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query data.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color mappings to CSS variables, animations, and plugin setup.",
  "project_state.json": "Describes the Dripify project state, features, assets, and versioning metadata for the build plan."
}